function mapMobile(mobile){
    if('15000000006' == mobile){
      return '18918138572';
    }
    if('18930998393' == mobile){
      return '13774378722';
    }
    if('18930998393' == mobile){
      return '13774378722';
    }
  
    //王宝亮,18817555187,红领巾学堂,王宝亮-乐课力,董博伟王燕-乐课力
    if('18817555187' == mobile){
      return '28817555187';
    }
    //陈志峰,18817368695,红领巾学堂,陈志峰-乐课力,董博伟王燕-乐课力
    if('18817368695' == mobile){
      return '28817368695';
    }
    //程老师,18818270152,红领巾学堂,程老师-乐课力,董博伟王燕-乐课力
    if('18818270152' == mobile){
      return '28818270152';
    }
    //甜橙课堂,talk mood(小明老师),15802111728
    if('15802111728' == mobile){
      return '25802111728';
    }
    return mobile;
  }

module.exports = mapMobile;
