function mapMobile(mobile){
    if('15000000006' == mobile){
      return '18918138572';
    }
    if('18930998393' == mobile){
      return '13774378722';
    }
    if('18930998393' == mobile){
      return '13774378722';
    }
  
    //王宝亮,18817555187,红领巾学堂,王宝亮-乐课力,董博伟王燕-乐课力
    //if('18817555187' == mobile){
    //  return '28817555187';
    //}
    //陈志峰,18817368695,红领巾学堂,陈志峰-乐课力,董博伟王燕-乐课力
    if('18817368695' == mobile){
      return '28817368695';
    }
    //程老师,18818270152,红领巾学堂,程老师-乐课力,董博伟王燕-乐课力
    if('18818270152' == mobile){
      return '28818270152';
    }
    //talk mood(小明老师),15802111728,甜橙课堂,橙子老师-乐课力,上海无公司老师,
    if('15802111728' == mobile){
      return '25802111728';
    }
    //朱小哈,18521352289,小哈老师的课堂,方鸣玉-乐课力
    if('18521352289' == mobile){
      return '28521352289';
    }
    //兰海,13683117404,兰海（大海）老师网校,北京无公司老师
    if('13683117404' == mobile){
      return '23683117404';
    }
    //陈蕾,13896605495,陈蕾学堂,大语文
    if('13896605495' == mobile){
      return '23896605495';
    }
    //林赟,13512139906,林赟老师网校,花儿
    if('13512139906' == mobile){
      return '23512139906';
    }
    //程迪,15121038698,程迪老师的在线课堂,周棋末-乐课力
    if('15121038698' == mobile){
      return '25121038698';
    }
    //孙倩,15216780080,孙漂亮的数学课堂,成钧孙倩-乐课力
    if('15216780080' == mobile){
      return '25216780080';
    }
    //徐凯,15021603756 ,Ken的英语课堂, Anna-乐课力
    if('15021603756' == mobile){
      return '25021603756 ';
    }
    //闫芳,15821414413,浦娃学堂, 闫芳乐课力 
    if('15821414413' == mobile){
      return '25821414413';
    }
    //陆伊烨,18912227576 ,陆伊烨-乐课力, 红领巾学堂里
    if('18912227576' == mobile){
      return '28912227576';
    }
    //杨捷,18635483316 ,网校很好用, 上海无老师网校
    if('18635483316' == mobile){
      return '28635483316 ';
    }

    return mobile;
  }

module.exports = mapMobile;
